Fix view and form mermaid
